tiborsimon/embedded-tdd-headers/pic/8bit/pic18f45k22_tdd.h
#define TMR5GIP                       1091
#define CTMUIP                        1092
#define TXBNIP                        1093
#define TX2IP                         1094
#define RC2IP                         1095
#define BCL2IP                        1096
#define SSP2IP                        1097
#define EECON1                        1098
#define RD                            1099
#define WR                            1100
#define WREN                          1101
#define WRERR                         1102
#define FREE                          1103
#define CFGS                          1104
#define EEFS                          1105
#define EEPGD                         1106
#define EECON2                        1107
#define EEDATA                        1108
#define EEADR                         1109
#define EEADR0                        1110
#define EEADR1                        1111
#define EEADR2                        1112
#define EEADR3                        1113
#define EEADR4                        1114
#define EEADR5                        1115
#define EEADR6                        1116
#define EEADR7                        1117
#define RCSTA1                        1118
#define RCSTA1_RX9D                   1119
#define RX9D1                         1120
#define RCD8                          1121
#define RCSTA1_OERR                   1122
#define OERR1                         1123
#define RCSTA1_FERR                   1124
#define FERR1                         1125
#define RCSTA1_ADDEN                  1126
#define RCSTA1_ADEN                   1127
#define ADDEN1                        1128
#define RCSTA1_CREN                   1129
#define CREN1                         1130
#define SRENA                         1131
#define SREN1                         1132
#define RCSTA1_SREN                   1133
#define RC8_9                         1134
#define RCSTA1_RX9                    1135
#define RC9                           1136
#define RX91                          1137
#define RCSTA1_SPEN                   1138
#define SPEN1                         1139
#define TXSTA1                        1140
#define TX9D1                         1141
#define TXSTA1_TX9D                   1142
#define TXD8                          1143
#define TRMT1                         1144
#define TXSTA1_TRMT                   1145
#define BRGH1                         1146
#define TXSTA1_BRGH                   1147
#define TXSTA1_SENDB                  1148
#define SENDB1                        1149
#define TXSTA1_SYNC                   1150
#define SYNC1                         1151
#define TXEN1                         1152
#define TXSTA1_TXEN                   1153
#define TX91                          1154
#define TX8_9                         1155
#define TXSTA1_TX9                    1156
#define TXSTA1_CSRC                   1157
#define CSRC1                         1158
#define TXREG1                        1159
#define TXREG                         1160
#define TX1REG                        1161
#define RCREG1                        1162
#define RCREG                         1163
#define RC1REG                        1164
#define SPBRG1                        1165
#define SPBRG                         1166
#define SP1BRG                        1167
#define SPBRGH1                       1168
#define SP1BRGH                       1169
#define SPBRGH                        1170
#define T3CON                         1171
#define TMR3ON                        1172
#define T3RD16                        1173
#define nT3SYNC                       1174
#define NOT_T3SYNC                    1175
#define SOSCEN3                       1176
#define T3SOSCEN                      1177
#define T3OSCEN                       1178
#define T3CKPS                        1179
#define T3CKPS0                       1180
#define T3CKPS1                       1181
#define TMR3CS0                       1182
#define TMR3CS                        1183
#define TMR3CS1                       1184
#define RD163                         1185
#define TMR3L                         1186
#define TMR3H                         1187
#define T3GCON                        1188
#define T3GSS0                        1189
#define T3GSS                         1190
#define T3GSS1                        1191
#define T3GVAL                        1192
#define T3GGO                         1193
#define T3GGO_NOT_DONE                1194
#define T3G_DONE                      1195
#define T3GGO_nDONE                   1196
#define T3GSPM                        1197
#define T3GTM                         1198
#define T3GPOL                        1199
#define TMR3GE                        1200
#define ECCP1AS                       1201
#define P1SSBD0                       1202
#define PSS1BD                        1203
#define P1SSBD                        1204
#define PSSBD                         1205
#define PSSBD0                        1206
#define PSS1BD0                       1207
#define P1SSBD1                       1208
#define PSSBD1                        1209
#define PSS1BD1                       1210
#define P1SSAC0                       1211
#define PSSAC                         1212
#define PSS1AC                        1213
#define PSSAC0                        1214
#define PSS1AC0                       1215
#define P1SSAC                        1216
#define P1SSAC1                       1217
#define PSSAC1                        1218
#define PSS1AC1                       1219
#define CCP1AS0                       1220
#define CCP1AS                        1221
#define ECCPAS                        1222
#define ECCPAS0                       1223
#define CCP1AS1                       1224
#define ECCPAS1                       1225
#define CCP1AS2                       1226
#define ECCPAS2                       1227
#define ECCPASE                       1228
#define CCP1ASE                       1229
#define PWM1CON                       1230
#define PDC0                          1231
#define P1DC                          1232
#define P1DC0                         1233
#define PDC                           1234
#define PDC1                          1235
#define P1DC1                         1236
#define PDC2                          1237
#define P1DC2                         1238
#define PDC3                          1239
#define P1DC3                         1240
#define PDC4                          1241
#define P1DC4                         1242
#define PDC5                          1243
#define P1DC5                         1244
#define P1DC6                         1245
#define PDC6                          1246
#define PRSEN                         1247
#define P1RSEN                        1248
#define BAUDCON1                      1249
#define BAUDCON1_ABDEN                1250
#define ABDEN1                        1251
#define BAUDCON1_WUE                  1252
#define WUE1                          1253
#define W4E                           1254
#define BRG161                        1255
#define BAUDCON1_BRG16                1256
#define BAUDCON1_CKTXP                1257
#define SCKP1                         1258
#define TXCKP                         1259
#define BAUDCON1_SCKP                 1260
#define TXCKP1                        1261
#define DTRXP1                        1262
#define RXDTP1                        1263
#define RXCKP                         1264
#define BAUDCON1_DTRXP                1265
#define RXDTP                         1266
#define RCMT1                         1267
#define RCIDL1                        1268
#define BAUDCON1_RCIDL                1269
#define RCMT                          1270
#define ABDOVF1                       1271
#define BAUDCON1_ABDOVF               1272
#define PSTR1CON                      1273
#define STR1A                         1274
#define STRA                          1275
#define STR1B                         1276
#define STRB                          1277
#define STR1C                         1278
#define STRC                          1279
#define STR1D                         1280
#define STRD                          1281
#define STR1SYNC                      1282
#define STRSYNC                       1283
#define T2CON                         1284
#define T2CKPS0                       1285
#define T2CKPS                        1286
#define T2CKPS1                       1287
#define TMR2ON                        1288
#define T2OUTPS0                      1289
#define T2OUTPS                       1290
#define T2OUTPS1                      1291
#define T2OUTPS2                      1292
#define T2OUTPS3                      1293
#define PR2                           1294
#define TMR2                          1295
#define CCP1CON                       1296
#define CCP1M0                        1297
#define CCP1M                         1298
#define CCP1M1                        1299
#define CCP1M2                        1300
#define CCP1M3                        1301
#define DC1B                          1302
#define DC1B0                         1303
#define DC1B1                         1304
#define P1M                           1305
#define P1M0                          1306
#define P1M1                          1307
#define CCPR1L                        1308
#define CCPR1H                        1309
#define ADCON2                        1310
#define ADCS0                         1311
#define ADCS                          1312
#define ADCS1                         1313
#define ADCS2                         1314
#define ACQT0                         1315
#define ACQT                          1316
#define ACQT1                         1317
#define ACQT2                         1318
#define ADFM                          1319
#define ADCON1                        1320
#define NVCFG                         1321
#define NVCFG0                        1322
#define NVCFG1                        1323
#define PVCFG                         1324
#define PVCFG0                        1325
#define CHSN3                         1326
#define PVCFG1                        1327
#define TRIGSEL                       1328
#define ADCON0                        1329
#define ADON                          1330
#define nDONE                         1331
#define GO_nDONE                      1332
#define NOT_DONE                      1333
#define GODONE                        1334
#define GO_DONE                       1335
#define DONE                          1336
#define GO_NOT_DONE                   1337
#define GO                            1338
#define CHS                           1339
#define CHS0                          1340
#define CHS1                          1341
#define CHS2                          1342
#define CHS3                          1343
#define CHS4                          1344
#define ADRESL                        1345
#define ADRESH                        1346
#define SSP1CON2                      1347
#define SEN1                          1348
#define SSP1CON2_SEN                  1349
#define ADMSK11                       1350
#define SSP1CON2_RSEN                 1351
#define RSEN1                         1352
#define ADMSK1                        1353
#define SSP1CON2_PEN                  1354
#define ADMSK21                       1355
#define PEN1                          1356
#define ADMSK2                        1357
#define ADMSK31                       1358
#define RCEN1                         1359
#define SSP1CON2_RCEN                 1360
#define ADMSK3                        1361
#define SSP1CON2_ACKEN                1362
#define ACKEN1                        1363
#define ADMSK41                       1364
#define ADMSK4                        1365
#define ACKDT1                        1366
#define ADMSK51                       1367
#define SSP1CON2_ACKDT                1368
#define ADMSK5                        1369
#define SSP1CON2_ACKSTAT              1370
#define ACKSTAT1                      1371
#define GCEN1                         1372
#define SSP1CON2_GCEN                 1373
#define SSP1CON1                      1374
#define SSP1CON1_SSPM0                1375
#define SSPM01                        1376
#define SSP1CON1_SSPM                 1377
#define SSP1CON1_SSPM1                1378
#define SSPM11                        1379
#define SSP1CON1_SSPM2                1380
#define SSPM21                        1381
#define SSPM31                        1382
#define SSP1CON1_SSPM3                1383
#define SSP1CON1_CKP                  1384
#define CKP1                          1385
#define SSPEN1                        1386
#define SSP1CON1_SSPEN                1387
#define SSPOV1                        1388
#define SSP1CON1_SSPOV                1389
#define WCOL1                         1390
#define SSP1CON1_WCOL                 1391
#define SSP1STAT                      1392
#define BF1                           1393
#define SSP1STAT_BF                   1394
#define UA1                           1395
#define SSP1STAT_UA                   1396
#define SSP1STAT_R_NOT_W              1397
#define READ_WRITE                    1398
#define RW1                           1399
#define NOT_W                         1400
#define SSP1STAT_W                    1401
#define I2C_READ                      1402
#define SSP1STAT_R                    1403
#define SSP1STAT_nW                   1404
#define RW                            1405
#define SSP1STAT_NOT_WRITE            1406
#define SSP1STAT_nWRITE               1407
#define SSP1STAT_R_W                  1408
#define SSP1STAT_R_nW                 1409
#define SSP1STAT_S                    1410
#define START                         1411
#define START1                        1412
#define I2C_START                     1413
#define STOP                          1414
#define SSP1STAT_P                    1415
#define STOP1                         1416
#define I2C_STOP                      1417
#define SSP1STAT_D                    1418
#define SSP1STAT_D_NOT_A              1419
#define NOT_A                         1420
#define SSP1STAT_D_A                  1421
#define SSP1STAT_D_nA                 1422
#define SSP1STAT_NOT_ADDRESS          1423
#define SSP1STAT_nA                   1424
#define SSP1STAT_A                    1425
#define DA1                           1426
#define DA                            1427
#define DATA_ADDRESS                  1428
#define SSP1STAT_nADDRESS             1429
#define I2C_DAT                       1430
#define SSP1STAT_CKE                  1431
#define CKE1                          1432
#define SSP1STAT_SMP                  1433
#define SMP1                          1434
#define SSP1ADD_SSPADD                1435
#define SSP1ADD_MSK0                  1436
#define MSK01                         1437
#define SSP1ADD                       1438
#define SSP1ADD_MSK1                  1439
#define MSK11                         1440
#define SSP1ADD_MSK2                  1441
#define MSK21                         1442
#define MSK31                         1443
#define SSP1ADD_MSK3                  1444
#define SSP1ADD_MSK4                  1445
#define MSK41                         1446
#define MSK51                         1447
#define SSP1ADD_MSK5                  1448
#define MSK61                         1449
#define SSP1ADD_MSK6                  1450
#define SSP1ADD_MSK7                  1451
#define MSK71                         1452
#define SSP1BUF_SSPBUF                1453
#define SSP1BUF                       1454
#define SSP1MSK                       1455
#define SSP1MSK_MSK0                  1456
#define SSP1MSK_MSK1                  1457
#define SSP1MSK_MSK2                  1458
#define SSP1MSK_MSK3                  1459
#define SSP1MSK_MSK4                  1460
#define SSP1MSK_MSK5                  1461
#define SSP1MSK_MSK6                  1462
#define SSP1MSK_MSK7                  1463
#define SSP1CON3                      1464
#define SSP1CON3_DHEN                 1465
#define SSP1CON3_AHEN                 1466
#define SSP1CON3_SBCDE                1467
#define SSP1CON3_SDAHT                1468
#define SSP1CON3_BOEN                 1469
#define SSP1CON3_SCIE                 1470
#define SSP1CON3_PCIE                 1471
#define SSP1CON3_ACKTIM               1472
#define T1GCON                        1473
#define T1GSS0                        1474
#define T1GSS                         1475
#define T1GSS1                        1476
#define T1GVAL                        1477
#define T1GGO_NOT_DONE                1478
#define T1GGO_nDONE                   1479
#define T1G_DONE                      1480
#define T1GGO                         1481
#define T1GSPM                        1482
#define T1GTM                         1483
#define T1GPOL                        1484
#define TMR1GE                        1485
#define T1CON                         1486
#define TMR1ON                        1487
#define RD16                          1488
#define T1RD16                        1489
#define NOT_T1SYNC                    1490
#define T1SYNC                        1491
#define nT1SYNC                       1492
#define T1SOSCEN                      1493
#define T1OSCEN                       1494
#define SOSCEN                        1495
#define T1CKPS0                       1496
#define T1CKPS                        1497
#define T1CKPS1                       1498
#define TMR1CS0                       1499
#define TMR1CS                        1500
#define TMR1CS1                       1501
#define TMR1L                         1502
#define TMR1H                         1503
#define RCON                          1504
#define BOR                           1505
#define NOT_BOR                       1506
#define nBOR                          1507
#define POR                           1508
#define nPOR                          1509
#define NOT_POR                       1510
#define PD                            1511
#define nPD                           1512
#define NOT_PD                        1513
#define NOT_TO                        1514
#define nTO                           1515
#define TO                            1516
#define nRI                           1517
#define NOT_RI                        1518
#define RI                            1519
#define SBOREN                        1520
#define IPEN                          1521
#define WDTCON                        1522
#define SWDTE                         1523
#define SWDTEN                        1524
#define OSCCON2                       1525
#define LFIOFS                        1526
#define MFIOFS                        1527
#define PRISD                         1528
#define SOSCGO                        1529
#define MFIOSEL                       1530
#define SOSCRUN                       1531
#define PLLRDY                        1532
#define OSCCON                        1533
#define SCS0                          1534
#define SCS                           1535
#define SCS1                          1536
#define IOFS                          1537
#define HFIOFS                        1538
#define OSTS                          1539
#define IRCF                          1540
#define IRCF0                         1541
#define IRCF1                         1542
#define IRCF2                         1543
#define IDLEN                         1544
#define T0CON                         1545
#define T0PS                          1546
#define T0PS0                         1547
#define T0PS1                         1548
#define T0PS2                         1549
#define PSA                           1550
#define T0SE                          1551
#define T0CS                          1552
#define T08BIT                        1553
#define TMR0ON                        1554
#define TMR0L                         1555
#define TMR0H                         1556
#define STATUS                        1557
#define C                             1558
#define CARRY                         1559
#define DC                            1560
#define ZERO                          1561
#define Z                             1562
#define OV                            1563
#define OVERFLOW                      1564
#define N                             1565
#define NEGATIVE                      1566
#define FSR2L                         1567
#define PLUSW2                        1568
#define PREINC2                       1569
#define POSTDEC2                      1570
#define POSTINC2                      1571
#define INDF2                         1572
#define FSR1L                         1573
#define PLUSW1                        1574
#define PREINC1                       1575
#define POSTDEC1                      1576
#define POSTINC1                      1577
#define INDF1                         1578
#define WREG                          1579
#define FSR0L                         1580
#define PLUSW0                        1581
#define PREINC0                       1582
#define POSTDEC0                      1583
#define POSTINC0                      1584
#define INDF0                         1585
#define INTCON3                       1586
#define INT1IF                        1587
#define INT1F                         1588
#define INT2IF                        1589
#define INT2F                         1590
#define INT1E                         1591
#define INT1IE                        1592
#define INT2IE                        1593
#define INT2E                         1594
#define INT1P                         1595
#define INT1IP                        1596
#define INT2IP                        1597
#define INT2P                         1598
#define INTCON2                       1599
#define RBIP                          1600
#define TMR0IP                        1601
#define INTEDG2                       1602
#define INTEDG1                       1603
#define INTEDG0                       1604
#define RBPU                          1605
#define NOT_RBPU                      1606
#define nRBPU                         1607
#define INTCON                        1608
#define RBIF                          1609
#define INT0F                         1610
#define INT0IF                        1611
#define T0IF                          1612
#define TMR0IF                        1613
#define RBIE                          1614
#define INT0E                         1615
#define INT0IE                        1616
#define T0IE                          1617
#define TMR0IE                        1618
#define PEIE                          1619
#define PEIE_GIEL                     1620
#define GIEL                          1621
#define GIE_GIEH                      1622
#define GIE                           1623
#define GIEH                          1624
#define PRODL                         1625
#define PRODH                         1626
#define TABLAT                        1627
#define TBLPTRL                       1628
#define TBLPTRH                       1629
#define TBLPTRU                       1630
#define ACSS                          1631
#define PCL                           1632
#define PCLATH                        1633
#define PCH                           1634
#define STKPTR0                       1635
#define STKPTR                        1636
#define SP0                           1637
#define STKPTR1                       1638
#define SP1                           1639
#define STKPTR2                       1640
#define SP2                           1641
#define SP3                           1642
#define STKPTR3                       1643
#define STKPTR4                       1644
#define SP4                           1645
#define STKUNF                        1646
#define STKOVF                        1647
#define STKFUL                        1648
#define TOSL                          1649
#define TOSH                          1650

#endif // _PIC18F45K22_H_
